{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.3,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.3,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ALLERGEN",
    "2": "I-ALLERGEN",
    "3": "B-SYMPTOM",
    "4": "I-SYMPTOM",
    "5": "B-MEDICATION",
    "6": "I-MEDICATION",
    "7": "B-LOC",
    "8": "I-LOC"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ALLERGEN": 1,
    "B-LOC": 7,
    "B-MEDICATION": 5,
    "B-SYMPTOM": 3,
    "I-ALLERGEN": 2,
    "I-LOC": 8,
    "I-MEDICATION": 6,
    "I-SYMPTOM": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
